# RoofArea_TotalProj

## Description
Returns the total area projected on the ground plane of roofs or roof faces that meet the criteria.

```pascal
FUNCTION RoofArea_TotalProj(c : CRITERIA) : REAL;
```

```python

def vs.RoofArea_TotalProj(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA||

## Version
Availability: from Vectorworks 2009
## Category
* Criteria